DataProcessors/МониторСверкиВзаиморасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>МониторСверкиВзаиморасчетов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/СервисСверкиРасчетовОбнаруженныеРасхождения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СервисСверкиРасчетовОбнаруженныеРасхождения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПоДаннымКонтрагента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервичныйДокументКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетФактураОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетФактураКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервичныйДокументОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДСПоДаннымКонтрагента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПоДаннымОрганизации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДСПоДаннымОрганизации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВалПоДаннымКонтрагента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВалПоДаннымОрганизации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИННКонтрагента</Name>
					<Comment>Заполняется когда в базе не найден контрагент по ИНН</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КППКонтрагента</Name>
					<Comment>Заполняется когда в базе не найден контрагент по КПП</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтрагентНеПроизводилСверку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДокументовОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДокументовКонтрагентов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодСверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияКонтрагентEDI</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СервисСверкиРасчетовДокументыПодлежащиеСверке</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСверкиПоОрганизации</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСверкиКонтрагенту</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторРасхождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>38</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СервисСверкиРасчетовДанныеСервиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СервисСверкиРасчетовДанныеСервиса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСчетФактуры</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СервисСверкиРасчетовВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСверки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодСверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияКонтрагентEDI</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/МониторСверкиВзаиморасчетов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура формирует расшифровочный отчет в форме состояния сверки
// 
// Параметры:
//    ПараметрыСверки - Структура - Структура с параметрами для заполнения.
// 
// Возвращаемое значение:
//  Структура - Сформировать расшифровку:
// * Результат - ТабличныйДокумент - 
// * АдресДанныхРасшифровки - Строка - 
//
Функция СформироватьРасшифровку(ПараметрыСверки) Экспорт
	
	ДанныеОтчета = ПолучитьДанныеОтчета(ПараметрыСверки);
	ИспользуетсяСервисСверкиРасчетов = Ложь;
	//++ Локализация
	ИспользуетсяСервисСверкиРасчетов = ПолучитьФункциональнуюОпцию("ИспользуетсяСервисСверкиРасчетов");
	//-- Локализация
	
	СхемаКомпоновкиДанных = ПолучитьМакет("СостояниеСверки");
	
	НастройкиПоУмолчанию = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	Если НЕ ПараметрыСверки.УчастникЭДО И ИспользуетсяСервисСверкиРасчетов Тогда
		НастройкиПоУмолчанию.Структура[1].Имя = "СверкаБезЭДО";
		НастройкиПоУмолчанию.Структура[1].Структура[0].Имя = "РасхожденияБезЭДО";
	ИначеЕсли ПараметрыСверки.УчастникЭДО И НЕ ИспользуетсяСервисСверкиРасчетов Тогда
		НастройкиПоУмолчанию.Структура[1].Имя = "СверкаБезСверка20";
		НастройкиПоУмолчанию.Структура[1].Структура[0].Имя = "РасхожденияБезСверка20";
	ИначеЕсли НЕ ПараметрыСверки.УчастникЭДО И НЕ ИспользуетсяСервисСверкиРасчетов Тогда
		НастройкиПоУмолчанию.Структура[1].Имя = "СверкаБезЭДОиСверка20";
		НастройкиПоУмолчанию.Структура[1].Структура[0].Имя = "РасхожденияБезЭДОиСверка20";
	КонецЕсли;
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиПоУмолчанию);
	
	Период = Новый СтандартныйПериод(ПараметрыСверки.НачалоПериода, ПараметрыСверки.КонецПериода);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Период", Период);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Организация", ПараметрыСверки.Организация);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Контрагент", ПараметрыСверки.Контрагент);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ПустаяСтрока", "");
	
	НастройкиДляКомпоновкиМакета = КомпоновщикНастроек.ПолучитьНастройки();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	Макет = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиДляКомпоновкиМакета, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ВнешниеНаборы = Новый Структура;
	ВнешниеНаборы.Вставить("ДанныеСверки", ДанныеОтчета.Сверка);
	ВнешниеНаборы.Вставить("КонтрольПериодаСверки", ДанныеОтчета.КонтрольСроков);
	ПроцессорКомпоновки.Инициализировать(Макет, ВнешниеНаборы, ДанныеРасшифровки, Истина);
	
	Результат = Новый ТабличныйДокумент;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	АдресДанныхРасшифровки = ПоместитьВоВременноеХранилище(ДанныеРасшифровки, ПараметрыСверки.УникальныйИдентификатор);
	РезультатРасшифровка = Новый Структура("Результат, АдресДанныхРасшифровки", Результат, АдресДанныхРасшифровки);
	
	Возврат РезультатРасшифровка;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеОтчета(ПараметрыСверки)
	
	//++ Локализация
	ИспользуетсяСервисСверкиРасчетов = ПолучитьФункциональнуюОпцию("ИспользуетсяСервисСверкиРасчетов");
	//-- Локализация
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗаспросаРасшифровочногоОтчета();
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыСверки.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ПараметрыСверки.КонецПериода);
	Запрос.УстановитьПараметр("ТипыРасчетов", ПараметрыСверки.ТипыРасчетов);
	Запрос.УстановитьПараметр("Организация", ПараметрыСверки.Организация);
	Запрос.УстановитьПараметр("Контрагент", ПараметрыСверки.Контрагент);
	Запрос.УстановитьПараметр("ПоВсемКонтрагентам", НЕ ЗначениеЗаполнено(ПараметрыСверки.Контрагент));
	Запрос.УстановитьПараметр("ТолькоНашиОрганизации", Ложь);
	Запрос.УстановитьПараметр("Менеджер", ПараметрыСверки.Менеджер);
	Запрос.УстановитьПараметр("ПоВсемМенеджерам", НЕ ЗначениеЗаполнено(ПараметрыСверки.Менеджер));
	Запрос.УстановитьПараметр("Валюта", ПараметрыСверки.Валюта);
	Запрос.УстановитьПараметр("ВалютаРегл", ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ПараметрыСверки.Организация));
	Запрос.УстановитьПараметр("ПоВсемВалютам", Ложь);
	Запрос.УстановитьПараметр("ЭтоВалютаРегл", ПараметрыСверки.ЭтоВалютаРегл);
	Запрос.УстановитьПараметр("ДоговорыБезОборотов", ПараметрыСверки.ВключатьДоговорыБезОборотов);
	//++ Локализация
	Запрос.УстановитьПараметр("ИспользуетсяСервисСверкиРасчетов", ИспользуетсяСервисСверкиРасчетов);
	//-- Локализация
	Запрос.УстановитьПараметр("ТипыСуммыАрендыДляСверки", Документы.СверкаВзаиморасчетов2_5_11.ТипыСуммАрендыДляСверки());
	Запрос.УстановитьПараметр("ПустаяСтрока", "");
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Результат = Новый Структура;
	Сверка = РезультатЗапроса[РезультатЗапроса.ВГраница()].Выгрузить();
	//++ Локализация
	ЕстьНеОтраженныеДокументыПоДаннымСерка20 = Ложь;
	//-- Локализация
	Для Каждого Запись Из Сверка Цикл
		Если НЕ ЗначениеЗаполнено(Запись.РасчетныйДокумент) И ЗначениеЗаполнено(Запись.ПредставлениеДокумента) Тогда
			Запись.ПредставлениеДокумента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("<%1 №%2 от %3>",
				Запись.ПредставлениеДокумента, Запись.НомерДокумента, Формат(Запись.ДатаДокумента, "ДЛФ=D"));
		КонецЕсли;
		Если Запись.СсылкаПредставление = Неопределено Тогда
			Запись.СсылкаПредставление = "<"+НСтр("ru = 'Не отражено в документах сверки взаиморасчетов'")+">";
			//++ Локализация
			ЕстьНеОтраженныеДокументыПоДаннымСерка20 = Истина;
			//-- Локализация
		КонецЕсли;
	КонецЦикла;
	
	СрокиСверки = РезультатЗапроса[РезультатЗапроса.ВГраница()-1].Выгрузить();
	КонтрольСроков = Новый ТаблицаЗначений;
	КонтрольСроков.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	КонтрольСроков.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТипСрока150 = Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(150));
	КонтрольСроков.Колонки.Добавить("ПоДаннымРасчетов", ТипСрока150);
	КонтрольСроков.Колонки.Добавить("Комментарий", ТипСрока150);
	Для Каждого Запись Из СрокиСверки Цикл
		НетДокументовРасчетов = НЕ ЗначениеЗаполнено(Запись.ДатаОперацииРасчетов);
		НетДокументовСверки = НЕ ЗначениеЗаполнено(Запись.МаксимальныйКонецПериодаСверки);
		НоваяСтрока = КонтрольСроков.Добавить();
		НоваяСтрока.Организация = Запись.Организация;
		НоваяСтрока.Контрагент = Запись.Контрагент;
		Запись.ДатаОперацииРасчетов = Макс(Запись.ДатаОперацииРасчетов, ПараметрыСверки.НачалоПериода);
		Запись.МаксимальныйКонецПериодаСверки = Макс(Запись.МаксимальныйКонецПериодаСверки, ПараметрыСверки.КонецПериода);
		
		Если НетДокументовРасчетов Тогда
			НоваяСтрока.ПоДаннымРасчетов = НСтр("ru = 'Расчеты за текущий период не производились'");
		Иначе
			НоваяСтрока.ПоДаннымРасчетов = НСтр("ru = 'Дата последней операции с контрагентом'") + " " + Формат(Запись.ДатаОперацииРасчетов, "ДЛФ=D");
		КонецЕсли;
		Если НетДокументовСверки Тогда
			Шаблон = НСтр("ru = 'Требуется ввести сверку с %1 по %2'");
			ТекстКомментария = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				Шаблон,
				Формат(ПараметрыСверки.НачалоПериода, "ДЛФ=D"),
				Формат(ПараметрыСверки.КонецПериода, "ДЛФ=D"));
		ИначеЕсли Запись.ДатаОперацииРасчетов > Запись.МаксимальныйКонецПериодаСверки Тогда
			Шаблон = НСтр("ru = 'Требуется ввести сверку с %1 по %2'");
			ТекстКомментария = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				Шаблон,
				Формат(Запись.МаксимальныйКонецПериодаСверки, "ДЛФ=D"),
				Формат(Запись.ДатаОперацииРасчетов, "ДЛФ=D"));
		//++ Локализация
		ИначеЕсли ЕстьНеОтраженныеДокументыПоДаннымСерка20 Тогда
			ТекстКомментария = НСтр("ru = 'По данным сервиса 1С:Сверка 2.0 у одной из сторон не отражены первичные документы'");
			
		//-- Локализация
		Иначе
			ТекстКомментария = НСтр("ru = 'Ввод документов сверки не требуется'");
		КонецЕсли;
		НоваяСтрока.Комментарий = ТекстКомментария;
	КонецЦикла;
	
	Если СрокиСверки.Количество() = 0 Тогда
		НоваяСтрока = КонтрольСроков.Добавить();
		НоваяСтрока.Организация = ПараметрыСверки.Организация;
		НоваяСтрока.Контрагент = ПараметрыСверки.Контрагент;
		НоваяСтрока.ПоДаннымРасчетов = НСтр("ru = 'Расчеты с контрагентом не производились'");
		Если Сверка.Количество() = 0 Тогда
			ТекстКомментария = НСтр("ru = 'Требуется сверка входящей задолженности'");
		Иначе
			ТекстКомментария = НСтр("ru = 'Требуется актуализировать документы сверки'");
		КонецЕсли;
		НоваяСтрока.Комментарий = ТекстКомментария;
	КонецЕсли;
	
	Результат.Вставить("Сверка", Сверка);
	Результат.Вставить("КонтрольСроков", КонтрольСроков);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗаспросаРасшифровочногоОтчета()

	ТекстЗапроса = Обработки.МониторСверкиВзаиморасчетов.ТекстЗапросаДанныеРасчетов() + 
	"////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сверка.Ссылка КАК Ссылка,
	|	Сверка.Номер КАК Номер,
	|	Сверка.Дата КАК Дата,
	|	Сверка.Валюта КАК Валюта,
	|	Сверка.Статус КАК Статус,
	|	СостоянияЭДО.СостояниеЭДО КАК СостояниеЭДО,
	|	Сверка.ЕстьРасхождения КАК ЕстьРасхождения,
	|	Сверка.НачалоПериода КАК НачалоПериода,
	|	Сверка.КонецПериода КАК КонецПериода,
	|	Сверка.Контрагент КАК Контрагент,
	|	Сверка.Организация КАК Организация,
	|	СУММА(тчИтоговыеЗаписи.КонечноеСальдоДт) КАК КонечноеСальдоДт,
	|	СУММА(тчИтоговыеЗаписи.КонечноеСальдоКт) КАК КонечноеСальдоКт,
	|	СУММА(ВЫБОР 
	|			КОГДА Сверка.ЕстьРасхождения 
	|				ТОГДА тчИтоговыеЗаписи.КонечноеСальдоДтКонтрагент
	|			ИНАЧЕ
	|				тчИтоговыеЗаписи.КонечноеСальдоДт
	|	КОНЕЦ) КАК КонечноеСальдоДтКонтрагент,
	|	СУММА(ВЫБОР 
	|			КОГДА Сверка.ЕстьРасхождения 
	|				ТОГДА тчИтоговыеЗаписи.КонечноеСальдоКтКонтрагент
	|			ИНАЧЕ
	|				тчИтоговыеЗаписи.КонечноеСальдоКт
	|	КОНЕЦ) КАК КонечноеСальдоКтКонтрагент
	|ПОМЕСТИТЬ втДокументыСверкиИтоги
	|ИЗ
	|	Документ.СверкаВзаиморасчетов2_5_11 КАК Сверка
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СверкаВзаиморасчетов2_5_11.ИтоговыеЗаписи КАК тчИтоговыеЗаписи
	|		ПО Сверка.Ссылка = тчИтоговыеЗаписи.Ссылка
	//++ Локализация
	|//++ Локализация
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияПоОбъектамУчетаЭДО КАК СостоянияЭДО
	|		ПО Сверка.Ссылка = СостоянияЭДО.СсылкаНаОбъект
	|//-- Локализация
	//-- Локализация
	|
	|ГДЕ
	|	Сверка.Проведен
	|	И (Сверка.Валюта = &Валюта ИЛИ Сверка.Валюта = &ВалютаРегл)
	|	И Сверка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСверокВзаиморасчетов2_5_11.Отклонена)
	|	И Сверка.Организация В (&Организация)
	|	И (&ПоВсемКонтрагентам ИЛИ Сверка.Контрагент В (&Контрагент))
	|	И ИтоговыеЗаписи.ТипРасчетов В (&ТипыРасчетов)
	|	И Сверка.НачалоПериода <= &КонецПериода
	|	И Сверка.КонецПериода >= &НачалоПериода
	|	И ИСТИНА В (ВЫБРАТЬ ПЕРВЫЕ 1 ИСТИНА 
	|				ИЗ 
	|					втОстаткиИОборотыПоДоговорам КАК ОстаткиИОбороты
	|				ГДЕ
	|					ОстаткиИОбороты.Договор = тчИтоговыеЗаписи.Договор)
	|	
	|СГРУППИРОВАТЬ ПО
	|	Сверка.Ссылка,
	|	Сверка.Номер,
	|	Сверка.Дата,
	|	Сверка.Валюта,
	|	Сверка.Статус,
	//++ Локализация
	|//++ Локализация
	|	СостоянияЭДО.СостояниеЭДО,
	|//-- Локализация
	//-- Локализация
	|	Сверка.ЕстьРасхождения,
	|	Сверка.НачалоПериода,
	|	Сверка.КонецПериода,
	|	Сверка.Контрагент,
	|	Сверка.Организация
	|	
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сверка.Ссылка КАК Ссылка,
	|	Сверка.Статус КАК Статус,
	|	Сверка.ЕстьРасхождения КАК ЕстьРасхождения,
	|	Сверка.НачалоПериода КАК НачалоПериода,
	|	Сверка.КонецПериода КАК КонецПериода,
	|	Сверка.Контрагент КАК Контрагент,
	|	Сверка.Организация КАК Организация,
	|	тчДетальныеЗаписи.РасчетныйДокумент КАК РасчетныйДокумент,
	|	тчДетальныеЗаписи.НомерДокумента КАК НомерДокумента,
	|	тчДетальныеЗаписи.ДатаДокумента КАК ДатаДокумента,
	|	ЕСТЬNULL(РеестрДокументов.НомерДокументаИБ, &ПустаяСтрока) КАК НомерДокументаИБ,
	|	ЕСТЬNULL(РеестрДокументов.ДатаДокументаИБ, ДАТАВРЕМЯ(1,1,1)) КАК ДатаДокументаИБ,
	|	СУММА(тчДетальныеЗаписи.СуммаДебет) КАК СуммаДт,
	|	СУММА(ВЫБОР 
	|			КОГДА Сверка.ЕстьРасхождения 
	|				ТОГДА тчДетальныеЗаписи.СуммаДебетКонтрагент
	|			ИНАЧЕ
	|				тчДетальныеЗаписи.СуммаДебет
	|	КОНЕЦ) КАК СуммаДтКонтрагент,
	|	СУММА(тчДетальныеЗаписи.СуммаКредит) КАК СуммаКт,
	|	СУММА(ВЫБОР 
	|			КОГДА Сверка.ЕстьРасхождения 
	|				ТОГДА тчДетальныеЗаписи.СуммаКредитКонтрагент
	|			ИНАЧЕ
	|				тчДетальныеЗаписи.СуммаКредит
	|	КОНЕЦ) КАК СуммаКтКонтрагент
	|
	|ПОМЕСТИТЬ втДокументыСверкиДетали
	|ИЗ
	|	Документ.СверкаВзаиморасчетов2_5_11 КАК Сверка
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СверкаВзаиморасчетов2_5_11.ДетальныеЗаписи КАК тчДетальныеЗаписи
	|		ПО Сверка.Ссылка = тчДетальныеЗаписи.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО тчДетальныеЗаписи.РасчетныйДокумент = РеестрДокументов.Ссылка
	|		И НЕ РеестрДокументов.ДополнительнаяЗапись
	|ГДЕ
	|	Сверка.Проведен
	|	И (Сверка.Валюта = &Валюта ИЛИ Сверка.Валюта = &ВалютаРегл)
	|	И Сверка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСверокВзаиморасчетов2_5_11.Отклонена)
	|	И Сверка.Организация В (&Организация)
	|	И (&ПоВсемКонтрагентам ИЛИ Сверка.Контрагент В (&Контрагент))
	|	И тчДетальныеЗаписи.ТипРасчетов В (&ТипыРасчетов)
	|	И Сверка.НачалоПериода <= &КонецПериода
	|	И Сверка.КонецПериода >= &НачалоПериода
	|	И ИСТИНА В (ВЫБРАТЬ ПЕРВЫЕ 1 ИСТИНА 
	|				ИЗ 
	|					втДокументыРасчетов КАК ДокументыРасчетов
	|				ГДЕ
	|					ДокументыРасчетов.Ссылка = тчДетальныеЗаписи.РасчетныйДокумент)
	|	
	|СГРУППИРОВАТЬ ПО
	|	Сверка.Ссылка,
	|	Сверка.Статус,
	|	Сверка.ЕстьРасхождения,
	|	Сверка.НачалоПериода,
	|	Сверка.КонецПериода,
	|	Сверка.Контрагент,
	|	Сверка.Организация,
	|	тчДетальныеЗаписи.РасчетныйДокумент,
	|	тчДетальныеЗаписи.НомерДокумента,
	|	тчДетальныеЗаписи.ДатаДокумента,
	|	РеестрДокументов.НомерДокументаИБ,
	|	РеестрДокументов.ДатаДокументаИБ
	|	
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СверкаИтоги.Ссылка КАК Ссылка,
	|	СверкаИтоги.Номер КАК Номер,
	|	СверкаИтоги.Дата КАК Дата,
	|	СверкаИтоги.Валюта КАК Валюта,
	|	СверкаИтоги.Статус КАК Статус,
	|	СверкаИтоги.СостояниеЭДО КАК СостояниеЭДО,
	|	СверкаИтоги.ЕстьРасхождения КАК ЕстьРасхождения,
	|	СверкаИтоги.НачалоПериода КАК НачалоПериода,
	|	СверкаИтоги.КонецПериода КАК КонецПериода,
	|	СверкаИтоги.Контрагент КАК Контрагент,
	|	СверкаИтоги.Организация КАК Организация,
	|	СверкаИтоги.КонечноеСальдоДт КАК КонечноеСальдоДт,
	|	СверкаИтоги.КонечноеСальдоКт КАК КонечноеСальдоКт,
	|	СверкаИтоги.КонечноеСальдоДтКонтрагент КАК КонечноеСальдоДтКонтрагент,
	|	СверкаИтоги.КонечноеСальдоКтКонтрагент КАК КонечноеСальдоКтКонтрагент,
	|	
	|	ЕСТЬNULL(СверкаДетали.РасчетныйДокумент, НЕОПРЕДЕЛЕНО) КАК РасчетныйДокумент,
	|	СверкаДетали.НомерДокумента КАК НомерДокумента,
	|	СверкаДетали.ДатаДокумента КАК ДатаДокумента,
	|	СверкаДетали.НомерДокументаИБ КАК НомерДокументаИБ,
	|	СверкаДетали.ДатаДокументаИБ КАК ДатаДокументаИБ,
	|	СверкаДетали.СуммаДт КАК СуммаДт,
	|	СверкаДетали.СуммаДтКонтрагент КАК СуммаДтКонтрагент,
	|	СверкаДетали.СуммаКт КАК СуммаКт,
	|	СверкаДетали.СуммаКтКонтрагент КАК СуммаКтКонтрагент
	|	
	|ПОМЕСТИТЬ втДокументыСверки
	|ИЗ
	|	втДокументыСверкиИтоги КАК СверкаИтоги
	|	ЛЕВОЕ СОЕДИНЕНИЕ втДокументыСверкиДетали КАК СверкаДетали
	|	ПО СверкаИтоги.Ссылка = СверкаДетали.ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Контрагент КАК Контрагент,
	|	ВложенныйЗапрос.Дата КАК Дата,
	|	ВложенныйЗапрос.Документ КАК Документ,
	|	ВложенныйЗапрос.ПредставлениеДокумента КАК ПредставлениеДокумента,
	|	ВложенныйЗапрос.ПредставлениеДокументаОрганизация КАК ПредставлениеДокументаОрганизация,
	|	ВложенныйЗапрос.ПредставлениеДокументаКонтрагент КАК ПредставлениеДокументаКонтрагент,
	|	ВложенныйЗапрос.Операция КАК Операция,
	|	ВложенныйЗапрос.ОперацияОрганизация КАК ОперацияОрганизация,
	|	ВложенныйЗапрос.ОперацияКонтрагент КАК ОперацияКонтрагент,
	|	ВложенныйЗапрос.НомерДокумента КАК НомерДокумента,
	|	ВложенныйЗапрос.ДатаДокумента КАК ДатаДокумента,
	|	ВложенныйЗапрос.НомерДокументаИБ КАК НомерДокументаИБ,
	|	ВложенныйЗапрос.ДатаДокументаИБ КАК ДатаДокументаИБ,
	|	СУММА(ВложенныйЗапрос.СуммаОрганизации) КАК СуммаОрганизации,
	|	СУММА(ВложенныйЗапрос.СуммаКонтрагента) КАК СуммаКонтрагента,
	|	СУММА(ВложенныйЗапрос.СуммаОрганизацииВВалютеРасчетов) КАК СуммаОрганизацииВВалютеРасчетов,
	|	СУММА(ВложенныйЗапрос.СуммаКонтрагентаВВалютеРасчетов) КАК СуммаКонтрагентаВВалютеРасчетов
	|ПОМЕСТИТЬ втДанныеСервисаСверка20Предварительная
	|ИЗ
	|	(ВЫБРАТЬ
	|		НЕОПРЕДЕЛЕНО КАК Организация,
	|		НЕОПРЕДЕЛЕНО КАК Контрагент,
	|		НЕОПРЕДЕЛЕНО КАК Дата,
	|		НЕОПРЕДЕЛЕНО КАК Документ,
	|		НЕОПРЕДЕЛЕНО КАК ПредставлениеДокумента,
	|		НЕОПРЕДЕЛЕНО КАК ПредставлениеДокументаОрганизация,
	|		НЕОПРЕДЕЛЕНО КАК ПредставлениеДокументаКонтрагент,
	|		НЕОПРЕДЕЛЕНО КАК Операция,
	|		НЕОПРЕДЕЛЕНО КАК ОперацияОрганизация,
	|		НЕОПРЕДЕЛЕНО КАК ОперацияКонтрагент,
	|		НЕОПРЕДЕЛЕНО КАК НомерДокумента,
	|		НЕОПРЕДЕЛЕНО КАК ДатаДокумента,
	|		НЕОПРЕДЕЛЕНО КАК НомерДокументаИБ,
	|		НЕОПРЕДЕЛЕНО КАК ДатаДокументаИБ,
	|		0.00 КАК СуммаОрганизации,
	|		0.00 КАК СуммаКонтрагента,
	|		0.00 КАК СуммаОрганизацииВВалютеРасчетов,
	|		0.00 КАК СуммаКонтрагентаВВалютеРасчетов
	|	ГДЕ
	|		ЛОЖЬ
	//++ Локализация
	|//++ Локализация
	|		
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		СервисСверкиРасхождения.Организация КАК Организация,
	|		СервисСверкиРасхождения.Контрагент КАК Контрагент,
	|		СервисСверкиРасхождения.Дата КАК Дата,
	|		ЕСТЬNULL(СервисСверкиРасхождения.Документ, НЕОПРЕДЕЛЕНО) КАК Документ,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ДанныеОрганизации.ПредставлениеДокумента, &ПустаяСтрока) <> &ПустаяСтрока
	|				ТОГДА ДанныеОрганизации.ПредставлениеДокумента
	|			КОГДА ДанныеКонтрагента.Операция ЕСТЬ НЕ NULL
	|				ТОГДА 
	|					ДанныеКонтрагента.Операция
	|		КОНЕЦ КАК ПредставлениеДокумента,
	|		ДанныеОрганизации.ПредставлениеДокумента КАК ПредставлениеДокументаОрганизация,
	|		ДанныеКонтрагента.ПредставлениеДокумента КАК ПредставлениеДокументаКонтрагент,
	|		ЕСТЬNULL(ДанныеОрганизации.Операция, ДанныеКонтрагента.Операция) КАК Операция,
	|		ЕСТЬNULL(ДанныеОрганизации.Операция, &ПустаяСтрока) КАК ОперацияОрганизация,
	|		ЕСТЬNULL(ДанныеКонтрагента.Операция, &ПустаяСтрока) КАК ОперацияКонтрагент,
	|		ЕСТЬNULL(ДанныеОрганизации.НомерДокумента, ДанныеКонтрагента.НомерДокумента) КАК НомерДокумента,
	|		ЕСТЬNULL(ДанныеОрганизации.ДатаДокумента, ДанныеКонтрагента.ДатаДокумента) КАК ДатаДокумента,
	|		ЕСТЬNULL(ДанныеОрганизации.НомерДокумента, ДанныеКонтрагента.НомерДокумента) КАК НомерДокументаИБ,
	|		ЕСТЬNULL(ДанныеОрганизации.ДатаДокумента, ДанныеКонтрагента.ДатаДокумента) КАК ДатаДокументаИБ,
	|		ЕСТЬNULL(СервисСверкиРасхождения.СуммаПоДаннымОрганизации,0) КАК СуммаОрганизации,
	|		ЕСТЬNULL(СервисСверкиРасхождения.СуммаПоДаннымКонтрагента,0) КАК СуммаКонтрагента,
	|		ВЫБОР 
	|			КОГДА &ЭтоВалютаРегл
	|				ТОГДА 
	|					ЕСТЬNULL(СервисСверкиРасхождения.СуммаПоДаннымОрганизации,0)
	|			ИНАЧЕ
	|				ЕСТЬNULL(СервисСверкиРасхождения.СуммаВалПоДаннымОрганизации,0)
	|		КОНЕЦ КАК СуммаОрганизацииВВалютеРасчетов,
	|		ВЫБОР 
	|			КОГДА &ЭтоВалютаРегл
	|				ТОГДА 
	|					ЕСТЬNULL(СервисСверкиРасхождения.СуммаПоДаннымКонтрагента,0)
	|			ИНАЧЕ
	|				ЕСТЬNULL(СервисСверкиРасхождения.СуммаВалПоДаннымКонтрагента,0)
	|		КОНЕЦ КАК СуммаКонтрагентаВВалютеРасчетов
	|	ИЗ
	|		РегистрСведений.СервисСверкиРасчетовОбнаруженныеРасхождения КАК СервисСверкиРасхождения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СервисСверкиРасчетовДанныеСервиса КАК ДанныеКонтрагента
	|		ПО СервисСверкиРасхождения.Организация = ДанныеКонтрагента.Организация
	|			И СервисСверкиРасхождения.Контрагент = ДанныеКонтрагента.Контрагент
	|			И СервисСверкиРасхождения.ИдентификаторСверкиКонтрагенту = ДанныеКонтрагента.ИдентификаторСверки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СервисСверкиРасчетовДанныеСервиса КАК ДанныеОрганизации
	|		ПО СервисСверкиРасхождения.Организация = ДанныеОрганизации.Организация
	|			И СервисСверкиРасхождения.Контрагент = ДанныеОрганизации.Контрагент
	|			И СервисСверкиРасхождения.ИдентификаторСверкиПоОрганизации = ДанныеОрганизации.ИдентификаторСверки
	|	ГДЕ
	|		&ИспользуетсяСервисСверкиРасчетов
	|		И СервисСверкиРасхождения.Организация = &Организация
	|		И СервисСверкиРасхождения.Контрагент = &Контрагент
	|		И СервисСверкиРасхождения.Дата >= &НачалоПериода
	|		И СервисСверкиРасхождения.Дата <= &КонецПериода
	|		И (
	|			(&ЭтоВалютаРегл
	|				И (ЕСТЬNULL(СервисСверкиРасхождения.СуммаВалПоДаннымОрганизации,0) = 0
	|					ИЛИ ЕСТЬNULL(СервисСверкиРасхождения.СуммаПоДаннымОрганизации,0) = ЕСТЬNULL(СервисСверкиРасхождения.СуммаВалПоДаннымОрганизации,0))
	|			ИЛИ
	|			НЕ &ЭтоВалютаРегл
	|				И ЕСТЬNULL(СервисСверкиРасхождения.СуммаВалПоДаннымОрганизации,0) <> 0
	|				И ЕСТЬNULL(СервисСверкиРасхождения.СуммаПоДаннымОрганизации,0) <> ЕСТЬNULL(СервисСверкиРасхождения.СуммаВалПоДаннымОрганизации,0)
	|			)//СуммаОганизации
	|			ИЛИ
	|			(&ЭтоВалютаРегл 
	|				И (ЕСТЬNULL(СервисСверкиРасхождения.СуммаВалПоДаннымКонтрагента,0) = 0
	|					ИЛИ ЕСТЬNULL(СервисСверкиРасхождения.СуммаВалПоДаннымКонтрагента,0) = ЕСТЬNULL(СервисСверкиРасхождения.СуммаВалПоДаннымКонтрагента,0))
	|			ИЛИ
	|			НЕ &ЭтоВалютаРегл 
	|				И ЕСТЬNULL(СервисСверкиРасхождения.СуммаВалПоДаннымКонтрагента,0) <> 0
	|				И ЕСТЬNULL(СервисСверкиРасхождения.СуммаПоДаннымКонтрагента,0) <> ЕСТЬNULL(СервисСверкиРасхождения.СуммаВалПоДаннымКонтрагента,0)
	|			)//СуммаКонтрагента
	|		)//ВалютнаяСумма
	|//-- Локализация
	//-- Локализация
	|	) КАК ВложенныйЗапрос
	|	
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Контрагент,
	|	ВложенныйЗапрос.Дата,
	|	ВложенныйЗапрос.Документ,
	|	ВложенныйЗапрос.ПредставлениеДокумента,
	|	ВложенныйЗапрос.ПредставлениеДокументаОрганизация,
	|	ВложенныйЗапрос.ПредставлениеДокументаКонтрагент,
	|	ВложенныйЗапрос.Операция,
	|	ВложенныйЗапрос.ОперацияОрганизация,
	|	ВложенныйЗапрос.ОперацияКонтрагент,
	|	ВложенныйЗапрос.НомерДокумента,
	|	ВложенныйЗапрос.ДатаДокумента,
	|	ВложенныйЗапрос.НомерДокументаИБ,
	|	ВложенныйЗапрос.ДатаДокументаИБ
	|
	|;
	//++ Локализация
	|//++ Локализация
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Контрагент КАК Контрагент,
	|	ВложенныйЗапрос.Дата КАК Дата,
	|	ВложенныйЗапрос.ВалютаРасчетов КАК ВалютаРасчетов,
	|	ВложенныйЗапрос.Документ КАК Документ,
	|	ВложенныйЗапрос.Регистратор КАК Регистратор,
	|	ВложенныйЗапрос.ПредставлениеДокумента КАК ПредставлениеДокумента,
	|	ВложенныйЗапрос.ПредставлениеДокументаОрганизация КАК ПредставлениеДокументаОрганизация,
	|	ВложенныйЗапрос.ПредставлениеДокументаКонтрагент КАК ПредставлениеДокументаКонтрагент,
	|	ВложенныйЗапрос.Операция КАК Операция,
	|	ВложенныйЗапрос.ОперацияОрганизация КАК ОперацияОрганизация,
	|	ВложенныйЗапрос.ОперацияКонтрагент КАК ОперацияКонтрагент,
	|	ВложенныйЗапрос.НомерДокумента КАК НомерДокумента,
	|	ВложенныйЗапрос.ДатаДокумента КАК ДатаДокумента,
	|	ВложенныйЗапрос.НомерДокументаИБ КАК НомерДокументаИБ,
	|	ВложенныйЗапрос.ДатаДокументаИБ КАК ДатаДокументаИБ,
	|	ВложенныйЗапрос.СуммаОрганизации КАК СуммаОрганизации,
	|	ВложенныйЗапрос.СуммаКонтрагента КАК СуммаКонтрагента,
	|	ВложенныйЗапрос.СуммаОрганизацииВВалютеРасчетов КАК СуммаОрганизацииВВалютеРасчетов,
	|	ВложенныйЗапрос.СуммаКонтрагентаВВалютеРасчетов КАК СуммаКонтрагентаВВалютеРасчетов
	|ПОМЕСТИТЬ втДанныеСервисаСверка20
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		СервисСверкиРасхождения.Организация КАК Организация,
	|		СервисСверкиРасхождения.Контрагент КАК Контрагент,
	|		СервисСверкиРасхождения.Дата КАК Дата,
	|		ЕСТЬNULL(Расчеты.Валюта, НЕОПРЕДЕЛЕНО) КАК ВалютаРасчетов,
	|		СервисСверкиРасхождения.Документ КАК Документ,
	|		ЕСТЬNULL(Расчеты.ДокументРегистратор, НЕОПРЕДЕЛЕНО) КАК Регистратор,
	|		СервисСверкиРасхождения.ПредставлениеДокумента КАК ПредставлениеДокумента,
	|		СервисСверкиРасхождения.ПредставлениеДокументаОрганизация КАК ПредставлениеДокументаОрганизация,
	|		СервисСверкиРасхождения.ПредставлениеДокументаКонтрагент КАК ПредставлениеДокументаКонтрагент,
	|		СервисСверкиРасхождения.Операция КАК Операция,
	|		СервисСверкиРасхождения.ОперацияОрганизация КАК ОперацияОрганизация,
	|		СервисСверкиРасхождения.ОперацияКонтрагент КАК ОперацияКонтрагент,
	|		СервисСверкиРасхождения.НомерДокумента КАК НомерДокумента,
	|		СервисСверкиРасхождения.ДатаДокумента КАК ДатаДокумента,
	|		СервисСверкиРасхождения.НомерДокументаИБ КАК НомерДокументаИБ,
	|		СервисСверкиРасхождения.ДатаДокументаИБ КАК ДатаДокументаИБ,
	|		СервисСверкиРасхождения.СуммаОрганизации КАК СуммаОрганизации,
	|		СервисСверкиРасхождения.СуммаКонтрагента КАК СуммаКонтрагента,
	|		СервисСверкиРасхождения.СуммаОрганизацииВВалютеРасчетов КАК СуммаОрганизацииВВалютеРасчетов,
	|		СервисСверкиРасхождения.СуммаКонтрагентаВВалютеРасчетов КАК СуммаКонтрагентаВВалютеРасчетов
	|	ИЗ
	|		втДанныеСервисаСверка20Предварительная КАК СервисСверкиРасхождения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК Расчеты
	|			ПО СервисСверкиРасхождения.Документ = Расчеты.ДокументРегистратор
	|	ГДЕ
	|		Расчеты.ДокументРегистратор ЕСТЬ НЕ NULL
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		СервисСверкиРасхождения.Организация КАК Организация,
	|		СервисСверкиРасхождения.Контрагент КАК Контрагент,
	|		СервисСверкиРасхождения.Дата КАК Дата,
	|		ЕСТЬNULL(Расчеты.Валюта, НЕОПРЕДЕЛЕНО) КАК ВалютаРасчетов,
	|		СервисСверкиРасхождения.Документ КАК Документ,
	|		ЕСТЬNULL(Расчеты.ДокументРегистратор, НЕОПРЕДЕЛЕНО) КАК Регистратор,
	|		СервисСверкиРасхождения.ПредставлениеДокумента КАК ПредставлениеДокумента,
	|		СервисСверкиРасхождения.ПредставлениеДокументаОрганизация КАК ПредставлениеДокументаОрганизация,
	|		СервисСверкиРасхождения.ПредставлениеДокументаКонтрагент КАК ПредставлениеДокументаКонтрагент,
	|		СервисСверкиРасхождения.Операция КАК Операция,
	|		СервисСверкиРасхождения.ОперацияОрганизация КАК ОперацияОрганизация,
	|		СервисСверкиРасхождения.ОперацияКонтрагент КАК ОперацияКонтрагент,
	|		СервисСверкиРасхождения.НомерДокумента КАК НомерДокумента,
	|		СервисСверкиРасхождения.ДатаДокумента КАК ДатаДокумента,
	|		СервисСверкиРасхождения.НомерДокументаИБ КАК НомерДокументаИБ,
	|		СервисСверкиРасхождения.ДатаДокументаИБ КАК ДатаДокументаИБ,
	|		СервисСверкиРасхождения.СуммаОрганизации КАК СуммаОрганизации,
	|		СервисСверкиРасхождения.СуммаКонтрагента КАК СуммаКонтрагента,
	|		СервисСверкиРасхождения.СуммаОрганизацииВВалютеРасчетов КАК СуммаОрганизацииВВалютеРасчетов,
	|		СервисСверкиРасхождения.СуммаКонтрагентаВВалютеРасчетов КАК СуммаКонтрагентаВВалютеРасчетов
	|	ИЗ
	|		втДанныеСервисаСверка20Предварительная КАК СервисСверкиРасхождения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК Расчеты
	|			ПО СервисСверкиРасхождения.Документ = Расчеты.ДокументРегистратор
	|	ГДЕ
	|		Расчеты.ДокументРегистратор ЕСТЬ НЕ NULL
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		СервисСверкиРасхождения.Организация КАК Организация,
	|		СервисСверкиРасхождения.Контрагент КАК Контрагент,
	|		СервисСверкиРасхождения.Дата КАК Дата,
	|		ЕСТЬNULL(Расчеты.Валюта, НЕОПРЕДЕЛЕНО) КАК ВалютаРасчетов,
	|		СервисСверкиРасхождения.Документ КАК Документ,
	|		ЕСТЬNULL(Расчеты.Регистратор, НЕОПРЕДЕЛЕНО) КАК Регистратор,
	|		СервисСверкиРасхождения.ПредставлениеДокумента КАК ПредставлениеДокумента,
	|		СервисСверкиРасхождения.ПредставлениеДокументаОрганизация КАК ПредставлениеДокументаОрганизация,
	|		СервисСверкиРасхождения.ПредставлениеДокументаКонтрагент КАК ПредставлениеДокументаКонтрагент,
	|		СервисСверкиРасхождения.Операция КАК Операция,
	|		СервисСверкиРасхождения.ОперацияОрганизация КАК ОперацияОрганизация,
	|		СервисСверкиРасхождения.ОперацияКонтрагент КАК ОперацияКонтрагент,
	|		СервисСверкиРасхождения.НомерДокумента КАК НомерДокумента,
	|		СервисСверкиРасхождения.ДатаДокумента КАК ДатаДокумента,
	|		СервисСверкиРасхождения.НомерДокументаИБ КАК НомерДокументаИБ,
	|		СервисСверкиРасхождения.ДатаДокументаИБ КАК ДатаДокументаИБ,
	|		СервисСверкиРасхождения.СуммаОрганизации КАК СуммаОрганизации,
	|		СервисСверкиРасхождения.СуммаКонтрагента КАК СуммаКонтрагента,
	|		СервисСверкиРасхождения.СуммаОрганизацииВВалютеРасчетов КАК СуммаОрганизацииВВалютеРасчетов,
	|		СервисСверкиРасхождения.СуммаКонтрагентаВВалютеРасчетов КАК СуммаКонтрагентаВВалютеРасчетов
	|	ИЗ
	|		втДанныеСервисаСверка20Предварительная КАК СервисСверкиРасхождения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоФинансовымИнструментам КАК Расчеты
	|			ПО СервисСверкиРасхождения.Документ = Расчеты.Регистратор
	|	ГДЕ
	|		Расчеты.Регистратор ЕСТЬ НЕ NULL
	|	) КАК ВложенныйЗапрос
	|ГДЕ
	|	(ВложенныйЗапрос.ВалютаРасчетов = &Валюта ИЛИ ВложенныйЗапрос.Регистратор = НЕОПРЕДЕЛЕНО)
	|;
	|//-- Локализация
	//-- Локализация
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Контрагент КАК Контрагент,
	|	МАКСИМУМ(ВложенныйЗапрос.ДатаОперацииРасчетов) КАК ДатаОперацииРасчетов,
	|	МАКСИМУМ(ВложенныйЗапрос.КонецПериодаСверки) КАК МаксимальныйКонецПериодаСверки
	|ИЗ  
	|	(ВЫБРАТЬ
	|		ДокументыРасчетов.Организация КАК Организация,
	|		ДокументыРасчетов.Контрагент КАК Контрагент,
	|		ДокументыРасчетов.Период КАК ДатаОперацииРасчетов,
	|		ДАТАВРЕМЯ(1,1,1) КАК КонецПериодаСверки
	|	ИЗ
	|		втДокументыРасчетов КАК ДокументыРасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СверкаИтоги.Организация КАК Организация,
	|		СверкаИтоги.Контрагент КАК Контрагент,
	|		ДАТАВРЕМЯ(1,1,1) КАК ДатаОперацииРасчетов,
	|		СверкаИтоги.КонецПериода КАК МаксимальныйКонецПериодаСверки
	|	ИЗ
	|		втДокументыСверкиИтоги КАК СверкаИтоги
	|	) КАК ВложенныйЗапрос
	|	
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВложенныйЗапрос.Ссылка) КАК СсылкаПредставление,
	|	ВложенныйЗапрос.Валюта КАК Валюта,
	|	ВложенныйЗапрос.Статус КАК Статус,
	|	ЕСТЬNULL(ВложенныйЗапрос.СостояниеЭДО, НЕОПРЕДЕЛЕНО) КАК СостояниеЭДО,
	|	ВложенныйЗапрос.ЕстьРасхождения КАК ЕстьРасхождения,
	|	ВложенныйЗапрос.НачалоПериода КАК НачалоПериода,
	|	ВложенныйЗапрос.КонецПериода КАК КонецПериода,
	|	ВложенныйЗапрос.Контрагент КАК Контрагент,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	
	|	ВложенныйЗапрос.КонечноеСальдоДт КАК ИтогоДолгКонтрагента,
	|	ВложенныйЗапрос.КонечноеСальдоКт КАК ИтогоНашДолг,
	|	ВложенныйЗапрос.КонечноеСальдоДтКонтрагент КАК КонтрагентИтогоДолгКонтрагента,
	|	ВложенныйЗапрос.КонечноеСальдоКтКонтрагент КАК КонтрагентИтогоНашДолг,
	|		
	|	ВложенныйЗапрос.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ВЫБОР 
	|		КОГДА ВложенныйЗапрос.РасчетныйДокумент = НЕОПРЕДЕЛЕНО
	|			ТОГДА ВложенныйЗапрос.ПредставлениеДокумента
	|		ИНАЧЕ
	|			ПРЕДСТАВЛЕНИЕССЫЛКИ(ВложенныйЗапрос.РасчетныйДокумент)
	|	КОНЕЦ КАК ПредставлениеДокумента,
	|	ВложенныйЗапрос.НомерДокумента КАК НомерДокумента,
	|	ВложенныйЗапрос.ДатаДокумента КАК ДатаДокумента,
	|	ВложенныйЗапрос.НомерДокументаИБ КАК НомерДокументаИБ,
	|	ВложенныйЗапрос.ДатаДокументаИБ КАК ДатаДокументаИБ,
	|	СУММА(ВложенныйЗапрос.СуммаДт) КАК ДолгКонтрагента,
	|	СУММА(ВложенныйЗапрос.СуммаДтКонтрагент) КАК КонтрагентДолгКонтрагента,
	|	СУММА(ВложенныйЗапрос.СуммаКт) КАК НашДолг,
	|	СУММА(ВложенныйЗапрос.СуммаКтКонтрагент) КАК КонтрагентНашДолг,
	|	ВЫБОР 
	|		КОГДА ВложенныйЗапрос.ЕстьРасхождения
	|			ТОГДА СУММА(ВложенныйЗапрос.СуммаДтКонтрагент) - СУММА(ВложенныйЗапрос.СуммаДт)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РасхождениеДолгКонтрагента,
	|	ВЫБОР 
	|		КОГДА ВложенныйЗапрос.ЕстьРасхождения
	|			ТОГДА СУММА(ВложенныйЗапрос.СуммаКтКонтрагент) - СУММА(ВложенныйЗапрос.СуммаКт)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РасхождениеНашДолг,
	|	СУММА(ВложенныйЗапрос.СуммаОрганизации) КАК СуммаОрганизации,
	|	СУММА(ВложенныйЗапрос.СуммаКонтрагента) КАК СуммаКонтрагента
	|ИЗ 
	|	(ВЫБРАТЬ
	|		ДетальныеЗаписи.Ссылка КАК Ссылка,
	|		ДетальныеЗаписи.Номер КАК Номер,
	|		ДетальныеЗаписи.Дата КАК Дата,
	|		ДетальныеЗаписи.Валюта КАК Валюта,
	|		ДетальныеЗаписи.Статус КАК Статус,
	|		ДетальныеЗаписи.СостояниеЭДО КАК СостояниеЭДО,
	|		ДетальныеЗаписи.ЕстьРасхождения КАК ЕстьРасхождения,
	|		ДетальныеЗаписи.НачалоПериода КАК НачалоПериода,
	|		ДетальныеЗаписи.КонецПериода КАК КонецПериода,
	|		ДетальныеЗаписи.Контрагент КАК Контрагент,
	|		ДетальныеЗаписи.Организация КАК Организация,
	|		
	|		ДетальныеЗаписи.КонечноеСальдоДт КАК КонечноеСальдоДт,
	|		ДетальныеЗаписи.КонечноеСальдоКт КАК КонечноеСальдоКт,
	|		ДетальныеЗаписи.КонечноеСальдоДтКонтрагент КАК КонечноеСальдоДтКонтрагент,
	|		ДетальныеЗаписи.КонечноеСальдоКтКонтрагент КАК КонечноеСальдоКтКонтрагент,
	|		
	|		ДетальныеЗаписи.РасчетныйДокумент КАК РасчетныйДокумент,
	|		НЕОПРЕДЕЛЕНО КАК ПредставлениеДокумента,
	|		ДетальныеЗаписи.НомерДокумента КАК НомерДокумента,
	|		ДетальныеЗаписи.ДатаДокумента КАК ДатаДокумента,
	|		ДетальныеЗаписи.НомерДокументаИБ КАК НомерДокументаИБ,
	|		ДетальныеЗаписи.ДатаДокументаИБ КАК ДатаДокументаИБ,
	|		ДетальныеЗаписи.СуммаДт КАК СуммаДт,
	|		ДетальныеЗаписи.СуммаДтКонтрагент КАК СуммаДтКонтрагент,
	|		ДетальныеЗаписи.СуммаКт КАК СуммаКт,
	|		ДетальныеЗаписи.СуммаКтКонтрагент КАК СуммаКтКонтрагент,
	|		0 КАК СуммаОрганизации,
	|		0 КАК СуммаКонтрагента
	|	ИЗ
	|		втДокументыСверки КАК ДетальныеЗаписи
	//++ Локализация
	|//++ Локализация
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДетальныеЗаписи.Ссылка КАК Ссылка,
	|		ДетальныеЗаписи.Номер КАК Номер,
	|		ДетальныеЗаписи.Дата КАК Дата,
	|		ДетальныеЗаписи.Валюта КАК Валюта,
	|		ДетальныеЗаписи.Статус КАК Статус,
	|		ДетальныеЗаписи.СостояниеЭДО КАК СостояниеЭДО,
	|		ДетальныеЗаписи.ЕстьРасхождения КАК ЕстьРасхождения,
	|		ДетальныеЗаписи.НачалоПериода КАК НачалоПериода,
	|		ДетальныеЗаписи.КонецПериода КАК КонецПериода,
	|		ДетальныеЗаписи.Контрагент КАК Контрагент,
	|		ДетальныеЗаписи.Организация КАК Организация,
	|		
	|		ДетальныеЗаписи.КонечноеСальдоДт КАК КонечноеСальдоДт,
	|		ДетальныеЗаписи.КонечноеСальдоКт КАК КонечноеСальдоКт,
	|		ДетальныеЗаписи.КонечноеСальдоДтКонтрагент КАК КонечноеСальдоДтКонтрагент,
	|		ДетальныеЗаписи.КонечноеСальдоКтКонтрагент КАК КонечноеСальдоКтКонтрагент,
	|		
	|		ДетальныеЗаписи.РасчетныйДокумент КАК РасчетныйДокумент,
	|		НЕОПРЕДЕЛЕНО КАК ПредставлениеДокумента,
	|		ДетальныеЗаписи.НомерДокумента КАК НомерДокумента,
	|		ДетальныеЗаписи.ДатаДокумента КАК ДатаДокумента,
	|		ДетальныеЗаписи.НомерДокументаИБ КАК НомерДокументаИБ,
	|		ДетальныеЗаписи.ДатаДокументаИБ КАК ДатаДокументаИБ,
	|		0 КАК СуммаДт,
	|		0 КАК СуммаДтКонтрагент,
	|		0 КАК СуммаКт,
	|		0 КАК СуммаКтКонтрагент,
	|		ВЫБОР
	|			КОГДА НЕ &ЭтоВалютаРегл И ДетальныеЗаписи.Валюта = &Валюта
	|				ТОГДА СервисСверкиРасхождения.СуммаОрганизацииВВалютеРасчетов
	|			ИНАЧЕ СервисСверкиРасхождения.СуммаОрганизации
	|		КОНЕЦ КАК СуммаОрганизации,
	|		ВЫБОР
	|			КОГДА НЕ &ЭтоВалютаРегл И ДетальныеЗаписи.Валюта = &Валюта
	|				ТОГДА СервисСверкиРасхождения.СуммаКонтрагентаВВалютеРасчетов
	|			ИНАЧЕ СервисСверкиРасхождения.СуммаКонтрагента
	|		КОНЕЦ КАК СуммаКонтрагента
	|	ИЗ
	|		втДокументыСверки КАК ДетальныеЗаписи
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДанныеСервисаСверка20 КАК СервисСверкиРасхождения
	|			ПО ДетальныеЗаписи.Организация = СервисСверкиРасхождения.Организация
	|			И ДетальныеЗаписи.Контрагент = СервисСверкиРасхождения.Контрагент
	|			И ДетальныеЗаписи.РасчетныйДокумент = СервисСверкиРасхождения.Документ
	|		
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		НЕОПРЕДЕЛЕНО КАК Ссылка,
	|		НЕОПРЕДЕЛЕНО КАК Номер,
	|		НЕОПРЕДЕЛЕНО КАК Дата,
	|		СервисСверкиРасхождения.ВалютаРасчетов КАК Валюта,
	|		НЕОПРЕДЕЛЕНО КАК Статус,
	|		НЕОПРЕДЕЛЕНО КАК СостояниеЭДО,
	|		ЛОЖЬ КАК ЕстьРасхождения,
	|		НЕОПРЕДЕЛЕНО КАК НачалоПериода,
	|		НЕОПРЕДЕЛЕНО КАК КонецПериода,
	|		СервисСверкиРасхождения.Контрагент КАК Контрагент,
	|		СервисСверкиРасхождения.Организация КАК Организация,
	|		
	|		НЕОПРЕДЕЛЕНО КАК КонечноеСальдоДт,
	|		НЕОПРЕДЕЛЕНО КАК КонечноеСальдоКт,
	|		НЕОПРЕДЕЛЕНО КАК КонечноеСальдоДтКонтрагент,
	|		НЕОПРЕДЕЛЕНО КАК КонечноеСальдоКтКонтрагент,
	|		
	|		СервисСверкиРасхождения.Документ КАК РасчетныйДокумент,
	|		ЕСТЬNULL(СервисСверкиРасхождения.ПредставлениеДокумента, НЕОПРЕДЕЛЕНО) КАК ПредставлениеДокумента,
	|		СервисСверкиРасхождения.НомерДокумента КАК НомерДокумента,
	|		СервисСверкиРасхождения.ДатаДокумента КАК ДатаДокумента,
	|		СервисСверкиРасхождения.НомерДокумента КАК НомерДокументаИБ,
	|		СервисСверкиРасхождения.ДатаДокумента КАК ДатаДокументаИБ,
	|		0 КАК СуммаДт,
	|		0 КАК СуммаДтКонтрагент,
	|		0 КАК СуммаКт,
	|		0 КАК СуммаКтКонтрагент,
	|		СервисСверкиРасхождения.СуммаОрганизацииВВалютеРасчетов КАК СуммаОрганизации,
	|		СервисСверкиРасхождения.СуммаКонтрагентаВВалютеРасчетов КАК СуммаКонтрагента
	|	ИЗ
	|		втДанныеСервисаСверка20 КАК СервисСверкиРасхождения
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДокументыСверки КАК ДетальныеЗаписи
	|			ПО ДетальныеЗаписи.Организация = СервисСверкиРасхождения.Организация
	|			И ДетальныеЗаписи.Контрагент = СервисСверкиРасхождения.Контрагент
	|			И ДетальныеЗаписи.РасчетныйДокумент = СервисСверкиРасхождения.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДокументыРасчетов КАК ДокументыРасчетов
	|			ПО ДокументыРасчетов.Организация = СервисСверкиРасхождения.Организация
	|			И ДокументыРасчетов.Контрагент = СервисСверкиРасхождения.Контрагент
	|			И ДокументыРасчетов.Ссылка = СервисСверкиРасхождения.Документ
	|	ГДЕ
	|		ДетальныеЗаписи.РасчетныйДокумент ЕСТЬ NULL
	|//-- Локализация
	//-- Локализация
	|	) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Ссылка,
	|	ВложенныйЗапрос.Номер,
	|	ВложенныйЗапрос.Дата,
	|	ВложенныйЗапрос.Валюта,
	|	ВложенныйЗапрос.Статус,
	|	ЕСТЬNULL(ВложенныйЗапрос.СостояниеЭДО, НЕОПРЕДЕЛЕНО),
	|	ВложенныйЗапрос.ЕстьРасхождения,
	|	ВложенныйЗапрос.НачалоПериода,
	|	ВложенныйЗапрос.КонецПериода,
	|	ВложенныйЗапрос.Контрагент,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.РасчетныйДокумент,
	|	ВложенныйЗапрос.ПредставлениеДокумента,
	|	ВложенныйЗапрос.НомерДокумента,
	|	ВложенныйЗапрос.ДатаДокумента,
	|	ВложенныйЗапрос.НомерДокументаИБ,
	|	ВложенныйЗапрос.ДатаДокументаИБ,
	|	ВложенныйЗапрос.КонечноеСальдоДт,
	|	ВложенныйЗапрос.КонечноеСальдоКт,
	|	ВложенныйЗапрос.КонечноеСальдоДтКонтрагент,
	|	ВложенныйЗапрос.КонечноеСальдоКтКонтрагент
	|	
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Дата,
	|	ВложенныйЗапрос.Номер,
	|	ВложенныйЗапрос.НачалоПериода,
	|	ВложенныйЗапрос.КонецПериода,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Контрагент,
	|	ВложенныйЗапрос.ДатаДокументаИБ,
	|	ВложенныйЗапрос.НомерДокументаИБ";
	
	Если НЕ ПолучитьФункциональнуюОпцию("ЛокализацияРФ") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"СостоянияЭДО.СостояниеЭДО","НЕОПРЕДЕЛЕНО");
	КонецЕсли;
	
	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

#КонецЕсли
